In [1]:
import pandas as pd

In [2]:
people = {
    "first" : ["Dharani", "Moulali", "Bharath"],
    "last" : ["Kumar", "Naguri", "Koramuntla"],
    "email" : ["gopavaram.dharani@gmail.com", "moulali.naguri@gmail.com", "reddybharath702@gmail.com"]
}

In [3]:
sample_df = pd.DataFrame(people)

In [4]:
sample_df

     first        last                        email
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [5]:
sample_df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
sample_df.columns = ['first_Name', 'last_Name', 'email']  # To rename all the columns in the dataframe

In [7]:
sample_df.columns

Index(['first_Name', 'last_Name', 'email'], dtype='object')

In [8]:
sample_df

  first_Name   last_Name                        email
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [8]:
sample_df.columns = [name.upper() for name in sample_df.columns]  # We can use list comprehension to update all the names

In [9]:
sample_df.columns = sample_df.columns.str.replace('_',' ')

In [10]:
sample_df

  FIRST NAME   LAST NAME                        EMAIL
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [12]:
sample_df.columns = sample_df.columns.str.replace(' ','_')

In [13]:
sample_df

  FIRST_NAME   LAST_NAME                        EMAIL
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [11]:
sample_df.rename(columns={'FIRST_NAME' : 'first', 'LAST_NAME' : 'last'})  # The changes won't get affected in the original dataframe

  FIRST NAME   LAST NAME                        EMAIL
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [12]:
sample_df

  FIRST NAME   LAST NAME                        EMAIL
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [13]:
sample_df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME' : 'last'}, inplace=True)  
# If we use inplace the changes will get affected to the dataframe as well

In [17]:
sample_df

     first        last                        EMAIL
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [14]:
sample_df.iloc[2] = ['Bharath', 'Reddi', 'bharath_koramuntla@gmail.com']  # changing all the values for a particular dataframe

In [15]:
sample_df

  FIRST NAME LAST NAME                         EMAIL
0    Dharani     Kumar   gopavaram.dharani@gmail.com
1    Moulali    Naguri      moulali.naguri@gmail.com
2    Bharath     Reddi  bharath_koramuntla@gmail.com

In [16]:
sample_df.loc[2, ["last", "EMAIL"]] = ["Koramuntla", "reddybharath702@gmail.com"]  # changing only the required values in a dataframe row

In [17]:
sample_df

  FIRST NAME LAST NAME                        EMAIL        last
0    Dharani     Kumar  gopavaram.dharani@gmail.com         NaN
1    Moulali    Naguri     moulali.naguri@gmail.com         NaN
2    Bharath     Reddi    reddybharath702@gmail.com  Koramuntla

In [25]:
sample_df.loc[2, "last"] = "Reddi"  # changing a single column in the dataframe row

In [26]:
sample_df

     first    last                        EMAIL
0  Dharani   Kumar  gopavaram.dharani@gmail.com
1  Moulali  Naguri     moulali.naguri@gmail.com
2  Bharath   Reddi    reddybharath702@gmail.com

In [28]:
sample_df.at[2, "last"] = "Koramuntla"  # If we want to change a single column in the dataframe we can use at method as well

In [29]:
sample_df

     first        last                        EMAIL
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [30]:
filter_1 = (sample_df['last'] == "Kumar") & (sample_df['first'] == "Dharani")

In [39]:
sample_df[filter_1]["EMAIL"] = "dharani.gopavaram@gmail.com"  # this doesn't make the change in the original dataframe

/var/folders/ys/r7h21r4524l3xvf6bmsdwyv00000gn/T/ipykernel_32055/4222765298.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sample_df[filter_1]["EMAIL"] = "dharani.gopavaram@gmail.com"

In [40]:
sample_df

     first        last                        EMAIL
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [43]:
sample_df.loc[filter_1,"EMAIL"] = "Dharani.gopavaram@gmail.com"  # to update the dataframe correctly use the loc function

In [44]:
sample_df

     first        last                        EMAIL
0  Dharani       Kumar  Dharani.gopavaram@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [51]:
sample_df['EMAIL'] = sample_df['EMAIL'].str.lower()  # To convert all the emails to lowercase

In [52]:
sample_df

     first        last                        EMAIL
0  Dharani       Kumar  dharani.gopavaram@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [18]:
sample_df['EMAIL'].apply(len)  # applying len function to all the values in the EMAIL column

0    27
1    24
2    25
Name: EMAIL, dtype: int64

In [19]:
def update_email(email):
    return email.upper()

In [20]:
sample_df['EMAIL'].apply(update_email)  # applying the userdefined function to all the values in the EMAIL column

0    GOPAVARAM.DHARANI@GMAIL.COM
1       MOULALI.NAGURI@GMAIL.COM
2      REDDYBHARATH702@GMAIL.COM
Name: EMAIL, dtype: object

In [21]:
sample_df

  FIRST NAME LAST NAME                        EMAIL        last
0    Dharani     Kumar  gopavaram.dharani@gmail.com         NaN
1    Moulali    Naguri     moulali.naguri@gmail.com         NaN
2    Bharath     Reddi    reddybharath702@gmail.com  Koramuntla

In [22]:
people = {
    "first" : ["Dharani", "Moulali", "Bharath"],
    "last" : ["Kumar", "Naguri", "Koramuntla"],
    "email" : ["gopavaram.dharani@gmail.com", "moulali.naguri@gmail.com", "reddybharath702@gmail.com"]
}

In [23]:
df = pd.DataFrame(people)

In [24]:
df

     first        last                        email
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [25]:
df['email'].apply(len)

0    27
1    24
2    25
Name: email, dtype: int64

In [26]:
def update_email(email):
    return email.upper()

In [27]:
df['email'].apply(update_email)

0    GOPAVARAM.DHARANI@GMAIL.COM
1       MOULALI.NAGURI@GMAIL.COM
2      REDDYBHARATH702@GMAIL.COM
Name: email, dtype: object

In [28]:
df

     first        last                        email
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com